driver-tests/bpelse/scalability/Test2/ScalabilityTest2CompApp/test/Test10000K/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:fm="http://services/fm">
  <soapenv:Body>
    <fm:getAlarmsBySeverity10000x1k>
      <correlationId>CORID-10000</correlationId>
      <duration>P0M0DT0H0M5S</duration>
      <message>Input Message</message>
    </fm:getAlarmsBySeverity10000x1k>
  </soapenv:Body>
</soapenv:Envelope>